УправДом/src/Documents/ОплатаЭлектроснабжения/ОплатаЭлектроснабжения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаЭлектроснабжения</name>
  <registerRecords>InformationRegister.СведенияПоЭлектроснабжению</registerRecords>
  <attributes>
    <name>ОплачиваемыйМесяц</name>
    <type>
      <types>CatalogRef.МесяцыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПлатежа</name>
    <type>
      <types>CatalogRef.ВидыПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Счетчик</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчетчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстановки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КвитанцияИзображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧекИзображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеПлатежа</name>
    <attributes>
      <name>ТекущиеПоказания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказанияНачисления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтарыеПоказания</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УправДом/src/InformationRegisters/СведенияПоЭлектроснабжению/СведенияПоЭлектроснабжению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияПоЭлектроснабжению</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ТекущиеПоказания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказанияНачисления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтарыеПоказания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодМесяцаОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОплачиваемыйМесяц</name>
    <type>
      <types>CatalogRef.МесяцыОплаты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправДом/src/InformationRegisters/ЦеныКомунальныхУслуг/ЦеныКомунальныхУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныКомунальныхУслуг</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодМесяца</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВидПлатежа</name>
    <type>
      <types>CatalogRef.ВидыПлатежей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МесяцНачалаДейсвия</name>
    <type>
      <types>CatalogRef.МесяцыОплаты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправДом/src/Catalogs/ВидыПлатежей/ВидыПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыПлатежей</name>
  <predefined>
    <items>
      <name>Газоснабжение</name>
      <description>Газоснабжение</description>
    </items>
    <items>
      <name>ДопУслугиИнтернет</name>
      <description>Допуслуги интернет</description>
    </items>
    <items>
      <name>Интернет</name>
      <description>Интернет</description>
    </items>
    <items>
      <name>ТКО</name>
      <description>ТКО</description>
    </items>
    <items>
      <name>Электроснабжение</name>
      <description>Электроснабжение</description>
    </items>
  </predefined>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Счетчик</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
</mdclass:Catalog>

УправДом/src/Documents/ОплатаЭлектроснабжения/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ЗаполнениеШапкиНаСервере()
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыПлатежей.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВидыПлатежей.Счетчик КАК Счетчик,
		|	ВидыПлатежей.Счетчик.Номер КАК СчетчикНомер,
		|	ВидыПлатежей.Счетчик.ДатаУстановки КАК СчетчикДатаУстановки
		|ИЗ
		|	Справочник.ВидыПлатежей КАК ВидыПлатежей
		|ГДЕ
		|	ВидыПлатежей.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ВидПлатежа);
	//Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);

	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();	
		Выборка.Следующий();
	
		 Объект.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
		 Объект.Счетчик = Выборка.Счетчик;
		 Объект.НомерСчетчика = Выборка.СчетчикНомер;
		 Объект.ДатаУстановки = Выборка.СчетчикДатаУстановки;
	 Иначе 
		 Сообщить("Ошибка.Заполните справочники в настройках")
	 КонецЕсли;
	 
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнениеШапкиНаСервере();
	Если Объект.ДанныеПлатежа.Количество() = 0 Тогда
		Элементы.ДанныеПлатежа.ДобавитьСтроку();
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция ЗаполнениеТЧНаСервере()
	
	 //получаем код поледних показаний, для формирования крайних показаний
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияПоЭлектроснабжениюСрезПоследних.КодМесяцаОплаты КАК КодМесяцаОплаты
		|ИЗ
		|	РегистрСведений.СведенияПоЭлектроснабжению.СрезПоследних КАК СведенияПоЭлектроснабжениюСрезПоследних";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	Индекс = Выборка.КодМесяцаОплаты;
	Если Индекс = 0 Тогда 
		ИндексМесяца = Индекс;
	Иначе
		ИндексМесяца = Число(Объект.ОплачиваемыйМесяц.Код)- 1;
	КонецЕсли;
	
	//получаем крайние показания счетчиков, на основе полученного выше ИндексМесяца
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СведенияПоЭлектроснабжениюСрезПоследних.ТекущиеПоказания,0) КАК ТекущиеПоказания,
		|	ЕСТЬNULL(СведенияПоЭлектроснабжениюСрезПоследних.ПоказанияНачисления,0) КАК ПоказанияНачисления
		|ИЗ
		|	РегистрСведений.СведенияПоЭлектроснабжению.СрезПоследних КАК СведенияПоЭлектроснабжениюСрезПоследних
		|ГДЕ
		|	СведенияПоЭлектроснабжениюСрезПоследних.КодМесяцаОплаты = &КодМесяцаОплаты";
	
	Запрос.УстановитьПараметр("КодМесяцаОплаты", ИндексМесяца);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой()Тогда
		Выборка = РезультатЗапроса.Выбрать();	
		Выборка.Следующий();
		
	   ПоказанияНачисления = Выборка.ТекущиеПоказания;
	   СтарыеПоказания = Выборка.ПоказанияНачисления;
   	Иначе
	   Сообщить("Проверьте установку начальных показаний счетчиков");

    КонецЕсли;
   
    // получаем актуальную цену по электроснабжению
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ЦеныКомунальныхУслугСрезПоследних.Цена, 0) КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныКомунальныхУслуг.СрезПоследних(
		|			,
		|			ВидПлатежа = &ВидПлатежа
		|				И КодМесяца <= &КодМесяца) КАК ЦеныКомунальныхУслугСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЦеныКомунальныхУслугСрезПоследних.Период УБЫВ";
	
	Запрос.УстановитьПараметр("ВидПлатежа", Объект.ВидПлатежа);
	Запрос.УстановитьПараметр("КодМесяца", Число(Объект.ОплачиваемыйМесяц.Код));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой()Тогда
		Выборка = РезультатЗапроса.Выбрать();	
		Выборка.Следующий();
	     
        Цена = Выборка.Цена;
	Иначе
		Сообщить("Цена не найдена");
	КонецЕсли;
	
   
      ДанныеПоказаний = Новый Структура;
	  ДанныеПоказаний.Вставить("ПоказанияНачисления",ПоказанияНачисления);
	  ДанныеПоказаний.Вставить("СтарыеПоказания",СтарыеПоказания);
	  ДанныеПоказаний.Вставить("Цена",Цена);
	  Возврат ДанныеПоказаний;
	
КонецФункции



&НаКлиенте
Процедура ОплачиваемыйМесяцПриИзменении(Элемент)
	Показания = ЗаполнениеТЧНаСервере();
	ТекДан = Элементы.ДанныеПлатежа.ТекущиеДанные;
	ТекДан.ПоказанияНачисления = Показания.ПоказанияНачисления;
	ТекДан.СтарыеПоказания = Показания.СтарыеПоказания;
	ТекДан.Цена = Показания.Цена;
	Если ТекДан.ПоказанияНачисления и  ТекДан.СтарыеПоказания <> Неопределено Тогда
		ТекДан.Количество  =  ТекДан.ПоказанияНачисления - ТекДан.СтарыеПоказания;	
		ТекДан.СуммаПлатежа = ТекДан.Количество * ТекДан.Цена;
	КонецЕсли;
КонецПроцедуры


// РАБОТА С КАРТИНКАМИ

&НаКлиенте
Асинх Процедура ЗагрузитьКвитанцию(Команда)
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	
	ОбещаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыДиалога,УникальныйИдентификатор);
	
	Если ОбещаниеФайла <> Неопределено Тогда 
		//ИзображениеКвитанция = ОбещаниеФайла.Адрес;
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ОбещаниеФайла.Адрес);
		Поток = ДвоичныеДанныеФайла.ОткрытьПотокДляЧтения();
		ЭтотОбъект.ИзображениеКвитанция.ПрочитатьАсинх(Поток);

		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//Если ЭтоАдресВременногоХранилища(ИзображениеКвитанция) Тогда
	//	ТекущийОбъект.КвитанцияИзображение = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(ИзображениеКвитанция));
	//ИначеЕсли ИзображениеКвитанция ="Очистить" Тогда
	//	ТекущийОбъект.КвитанцияИзображение = Новый ХранилищеЗначения(Неопределено);
	//КонецЕсли;
	ТекущийОбъект.КвитанцияИзображение = Новый ХранилищеЗначения(ИзображениеКвитанция);

	
	
	//Если ЭтоАдресВременногоХранилища(ИзображениеЧек) Тогда
	//	ТекущийОбъект.ЧекИзображение = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(ИзображениеЧек));
	//ИначеЕсли ИзображениеЧек ="Очистить" Тогда
	//	ТекущийОбъект.ЧекИзображение = Новый ХранилищеЗначения(Неопределено);
	//КонецЕсли;
    ТекущийОбъект.ЧекИзображение = Новый ХранилищеЗначения(ИзображениеЧек);

	

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	//ИзображениеКвитанция = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"КвитанцияИзображение");
	ИзображениеКвитанция = ТекущийОбъект.КвитанцияИзображение.Получить();

	
	//ИзображениеЧек = ПолучитьНавигационнуюСсылку(Объект.Ссылка,"ЧекИзображение");
	ИзображениеЧек = ТекущийОбъект.ЧекИзображение.Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКвитанцию(Команда)
	
	ИзображениеКвитанция = "Очистить";
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗагрузитьЧек(Команда)
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	
	ОбещаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыДиалога,УникальныйИдентификатор);
	
	Если ОбещаниеФайла <> Неопределено Тогда 
		//ИзображениеЧек = ОбещаниеФайла.Адрес;
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ОбещаниеФайла.Адрес);
		Поток = ДвоичныеДанныеФайла.ОткрытьПотокДляЧтения();
		ЭтотОбъект.ИзображениеЧек.ПрочитатьАсинх(Поток);
		
		Модифицированность = Истина;
	КонецЕсли;

		
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЧек(Команда)
	ИзображениеЧек = "Очистить";
	Модифицированность = Истина;
КонецПроцедуры
